tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf18875_tdd.h
#define CWG3DBR0                      2207
#define CWG3DBR_DBR0                  2208
#define CWG3DBR_DBR                   2209
#define CWG3DBR_DBR1                  2210
#define CWG3DBR1                      2211
#define CWG3DBR_DBR2                  2212
#define CWG3DBR2                      2213
#define CWG3DBR_DBR3                  2214
#define CWG3DBR3                      2215
#define CWG3DBR_DBR4                  2216
#define CWG3DBR4                      2217
#define CWG3DBR_DBR5                  2218
#define CWG3DBR5                      2219
#define CWG3DBF0                      2220
#define CWG3DBF_DBF0                  2221
#define CWG3DBF                       2222
#define CWG3DBF_DBF                   2223
#define CWG3DBF1                      2224
#define CWG3DBF_DBF1                  2225
#define CWG3DBF2                      2226
#define CWG3DBF_DBF2                  2227
#define CWG3DBF3                      2228
#define CWG3DBF_DBF3                  2229
#define CWG3DBF4                      2230
#define CWG3DBF_DBF4                  2231
#define CWG3DBF5                      2232
#define CWG3DBF_DBF5                  2233
#define CWG3CON0                      2234
#define CWG3MODE                      2235
#define CWG3MODE0                     2236
#define CWG3CON0_MODE                 2237
#define CWG3CON0_MODE0                2238
#define CWG3MODE1                     2239
#define CWG3CON0_MODE1                2240
#define CWG3MODE2                     2241
#define CWG3CON0_MODE2                2242
#define CWG3LD                        2243
#define CWG3CON0_LD                   2244
#define G3EN                          2245
#define CWG3EN                        2246
#define CWG3CON0_EN                   2247
#define CWG3CON1                      2248
#define CWG3CON1_POLA                 2249
#define CWG3POLA                      2250
#define CWG3CON1_POLB                 2251
#define CWG3POLB                      2252
#define CWG3CON1_POLC                 2253
#define CWG3POLC                      2254
#define CWG3POLD                      2255
#define CWG3CON1_POLD                 2256
#define CWG3IN                        2257
#define CWG3CON1_IN                   2258
#define CWG3AS0                       2259
#define CWG3AS0_LSAC                  2260
#define CWG3LSAC0                     2261
#define CWG3AS0_LSAC0                 2262
#define CWG3LSAC                      2263
#define CWG3LSAC1                     2264
#define CWG3AS0_LSAC1                 2265
#define CWG3LSBD                      2266
#define CWG3AS0_LSBD                  2267
#define CWG3LSBD0                     2268
#define CWG3AS0_LSBD0                 2269
#define CWG3LSBD1                     2270
#define CWG3AS0_LSBD1                 2271
#define CWG3AS0_REN                   2272
#define CWG3REN                       2273
#define CWG3SHUTDOWN                  2274
#define CWG3AS0_SHUTDOWN              2275
#define CWG3AS1                       2276
#define CWG3AS1_AS0E                  2277
#define CWG3AS1_AS1E                  2278
#define CWG3AS1_AS2E                  2279
#define CWG3AS1_AS3E                  2280
#define CWG3AS1_AS4E                  2281
#define CWG3AS1_AS5E                  2282
#define CWG3AS1_AS6E                  2283
#define CWG3STR                       2284
#define CWG3STRA                      2285
#define CWG3STR_STRA                  2286
#define CWG3STRB                      2287
#define CWG3STR_STRB                  2288
#define CWG3STRC                      2289
#define CWG3STR_STRC                  2290
#define CWG3STR_STRD                  2291
#define CWG3STRD                      2292
#define CWG3STR_OVRA                  2293
#define CWG3OVRA                      2294
#define CWG3STR_OVRB                  2295
#define CWG3OVRB                      2296
#define CWG3STR_OVRC                  2297
#define CWG3OVRC                      2298
#define CWG3OVRD                      2299
#define CWG3STR_OVRD                  2300
#define PIR0                          2301
#define INTF                          2302
#define IOCIF                         2303
#define TMR0IF                        2304
#define PIR1                          2305
#define ADIF                          2306
#define ADTIF                         2307
#define CSWIF                         2308
#define OSFIF                         2309
#define PIR2                          2310
#define C1IF                          2311
#define C2IF                          2312
#define ZCDIF                         2313
#define PIR3                          2314
#define SSP1IF                        2315
#define BCL1IF                        2316
#define SSP2IF                        2317
#define BCL2IF                        2318
#define TXIF                          2319
#define RCIF                          2320
#define PIR4                          2321
#define TMR1IF                        2322
#define TMR2IF                        2323
#define TMR3IF                        2324
#define TMR4IF                        2325
#define TMR5IF                        2326
#define TMR6IF                        2327
#define PIR5                          2328
#define TMR1GIF                       2329
#define TMR3GIF                       2330
#define TMR5GIF                       2331
#define CLC1IF                        2332
#define CLC2IF                        2333
#define CLC3IF                        2334
#define CLC4IF                        2335
#define PIR6                          2336
#define CCP1IF                        2337
#define CCP2IF                        2338
#define CCP3IF                        2339
#define CCP4IF                        2340
#define CCP5IF                        2341
#define PIR7                          2342
#define CWG1IF                        2343
#define CWG2IF                        2344
#define CWG3IF                        2345
#define NCO1IF                        2346
#define NCOIF                         2347
#define NVMIF                         2348
#define CRCIF                         2349
#define SCANIF                        2350
#define PIR8                          2351
#define SMT1IF                        2352
#define SMT1PRAIF                     2353
#define SMT1PWAIF                     2354
#define SMT2IF                        2355
#define SMT2PRAIF                     2356
#define SMT2PWAIF                     2357
#define PIE0                          2358
#define INTE                          2359
#define IOCIE                         2360
#define TMR0IE                        2361
#define PIE1                          2362
#define ADIE                          2363
#define ADTIE                         2364
#define CSWIE                         2365
#define OSFIE                         2366
#define PIE2                          2367
#define C1IE                          2368
#define C2IE                          2369
#define ZCDIE                         2370
#define PIE3                          2371
#define SSP1IE                        2372
#define BCL1IE                        2373
#define SSP2IE                        2374
#define BCL2IE                        2375
#define TXIE                          2376
#define RCIE                          2377
#define PIE4                          2378
#define TMR1IE                        2379
#define TMR2IE                        2380
#define TMR3IE                        2381
#define TMR4IE                        2382
#define TMR5IE                        2383
#define TMR6IE                        2384
#define PIE5                          2385
#define TMR1GIE                       2386
#define TMR3GIE                       2387
#define TMR5GIE                       2388
#define CLC1IE                        2389
#define CLC2IE                        2390
#define CLC3IE                        2391
#define CLC4IE                        2392
#define PIE6                          2393
#define CCP1IE                        2394
#define CCP2IE                        2395
#define CCP3IE                        2396
#define CCP4IE                        2397
#define CCP5IE                        2398
#define PIE7                          2399
#define CWG1IE                        2400
#define CWG2IE                        2401
#define CWG3IE                        2402
#define NCO1IE                        2403
#define NCOIE                         2404
#define NVMIE                         2405
#define CRCIE                         2406
#define SCANIE                        2407
#define PIE8                          2408
#define SMT1IE                        2409
#define SMT1PRAIE                     2410
#define SMT1PWAIE                     2411
#define SMT2IE                        2412
#define SMT2PRAIE                     2413
#define SMT2PWAIE                     2414
#define PMD0                          2415
#define IOCMD                         2416
#define CLKRMD                        2417
#define NVMMD                         2418
#define SCANMD                        2419
#define CRCMD                         2420
#define FVRMD                         2421
#define SYSCMD                        2422
#define PMD1                          2423
#define TMR0MD                        2424
#define TMR1MD                        2425
#define TMR2MD                        2426
#define TMR3MD                        2427
#define TMR4MD                        2428
#define TMR5MD                        2429
#define TMR6MD                        2430
#define NCOMD                         2431
#define NCO1MD                        2432
#define PMD2                          2433
#define ZCDMD                         2434
#define CMP1MD                        2435
#define CMP2MD                        2436
#define ADCMD                         2437
#define DACMD                         2438
#define PMD3                          2439
#define CCP1MD                        2440
#define CCP2MD                        2441
#define CCP3MD                        2442
#define CCP4MD                        2443
#define CCP5MD                        2444
#define PWM6MD                        2445
#define PWM7MD                        2446
#define PMD4                          2447
#define CWG1MD                        2448
#define CWG2MD                        2449
#define CWG3MD                        2450
#define MSSP1MD                       2451
#define MSSP2MD                       2452
#define UART1MD                       2453
#define PMD5                          2454
#define DSMMD                         2455
#define CLC1MD                        2456
#define CLC2MD                        2457
#define CLC3MD                        2458
#define CLC4MD                        2459
#define SMT1MD                        2460
#define SMT2MD                        2461
#define WDTCON0                       2462
#define WDTCON0_SEN                   2463
#define SWDTEN                        2464
#define WDTSEN                        2465
#define WDTPS                         2466
#define WDTPS0                        2467
#define WDTPS1                        2468
#define WDTPS2                        2469
#define WDTPS3                        2470
#define WDTPS4                        2471
#define WDTCON1                       2472
#define WDTWINDOW0                    2473
#define WINDOW0                       2474
#define WINDOW                        2475
#define WDTWINDOW                     2476
#define WDTWINDOW1                    2477
#define WINDOW1                       2478
#define WDTWINDOW2                    2479
#define WINDOW2                       2480
#define WDTCS                         2481
#define WDTCS0                        2482
#define WDTCS1                        2483
#define WDTCS2                        2484
#define WDTPSL                        2485
#define WDTPSL_WDTPSCNT               2486
#define WDTPSL_PSCNT                  2487
#define WDTPSCNT0                     2488
#define PSCNT0                        2489
#define WDTPSCNT1                     2490
#define PSCNT1                        2491
#define WDTPSCNT2                     2492
#define PSCNT2                        2493
#define WDTPSCNT3                     2494
#define PSCNT3                        2495
#define WDTPSCNT4                     2496
#define PSCNT4                        2497
#define WDTPSCNT5                     2498
#define PSCNT5                        2499
#define WDTPSCNT6                     2500
#define PSCNT6                        2501
#define WDTPSCNT7                     2502
#define PSCNT7                        2503
#define WDTPSH                        2504
#define PSCNT8                        2505
#define WDTPSH_WDTPSCNT               2506
#define WDTPSH_PSCNT                  2507
#define WDTPSCNT8                     2508
#define PSCNT9                        2509
#define WDTPSCNT9                     2510
#define PSCNT10                       2511
#define WDTPSCNT10                    2512
#define PSCNT11                       2513
#define WDTPSCNT11                    2514
#define PSCNT12                       2515
#define WDTPSCNT12                    2516
#define PSCNT13                       2517
#define WDTPSCNT13                    2518
#define PSCNT14                       2519
#define WDTPSCNT14                    2520
#define PSCNT15                       2521
#define WDTPSCNT15                    2522
#define PSCNT16                       2523
#define WDTPSCNT16                    2524
#define WDTPSCNT17                    2525
#define PSCNT17                       2526
#define STATE                         2527
#define WDTSTATE                      2528
#define WDTTMR                        2529
#define WDTTMR0                       2530
#define WDTTMR1                       2531
#define WDTTMR2                       2532
#define WDTTMR3                       2533
#define BORCON                        2534
#define BORRDY                        2535
#define SBOREN                        2536
#define PCON0                         2537
#define nBOR                          2538
#define nPOR                          2539
#define nRI                           2540
#define nRMCLR                        2541
#define nRWDT                         2542
#define nWDTWV                        2543
#define STKUNF                        2544
#define STKOVF                        2545
#define CCDCON                        2546
#define CCDS0                         2547
#define CCDS1                         2548
#define CCDEN                         2549
#define NVMADRL                       2550
#define NVMADR0                       2551
#define NVMADR1                       2552
#define NVMADR2                       2553
#define NVMADR3                       2554
#define NVMADR4                       2555
#define NVMADR5                       2556
#define NVMADR6                       2557
#define NVMADR7                       2558
#define NVMADRH                       2559
#define NVMADR8                       2560
#define NVMADR9                       2561
#define NVMADR10                      2562
#define NVMADR11                      2563
#define NVMADR12                      2564
#define NVMADR13                      2565
#define NVMADR14                      2566
#define NVMDATL                       2567
#define NVMDAT0                       2568
#define NVMDAT1                       2569
#define NVMDAT2                       2570
#define NVMDAT3                       2571
#define NVMDAT4                       2572
#define NVMDAT5                       2573
#define NVMDAT6                       2574
#define NVMDAT7                       2575
#define NVMDATH                       2576
#define NVMDAT8                       2577
#define NVMDAT9                       2578
#define NVMDAT10                      2579
#define NVMDAT11                      2580
#define NVMDAT12                      2581
#define NVMDAT13                      2582
#define NVMCON1                       2583
#define RD                            2584
#define WR                            2585
#define WREN                          2586
#define WRERR                         2587
#define FREE                          2588
#define LWLO                          2589
#define NVMREGS                       2590
#define CPUDOZE                       2591
#define DOZE0                         2592
#define DOZE1                         2593
#define DOZE2                         2594
#define DOE                           2595
#define ROI                           2596
#define DOZEN                         2597
#define IDLEN                         2598
#define OSCCON1                       2599
#define NDIV0                         2600
#define NDIV                          2601
#define NDIV1                         2602
#define NDIV2                         2603
#define NDIV3                         2604
#define NOSC0                         2605
#define NOSC                          2606
#define NOSC1                         2607
#define NOSC2                         2608
#define OSCCON2                       2609
#define CDIV0                         2610
#define CDIV                          2611
#define CDIV1                         2612
#define CDIV2                         2613
#define CDIV3                         2614
#define COSC                          2615
#define COSC0                         2616
#define COSC1                         2617
#define COSC2                         2618
#define OSCCON3                       2619
#define NOSCR                         2620
#define ORDY                          2621
#define SOSCPWR                       2622
#define CSWHOLD                       2623
#define OSCSTAT                       2624
#define PLLR                          2625
#define ADOR                          2626
#define SOR                           2627
#define LFOR                          2628
#define MFOR                          2629
#define HFOR                          2630
#define EXTOR                         2631
#define OSCEN                         2632
#define ADOEN                         2633
#define SOSCEN                        2634
#define LFOEN                         2635
#define MFOEN                         2636
#define HFOEN                         2637
#define EXTOEN                        2638
#define OSCTUNE                       2639
#define HFTUN0                        2640
#define HFTUN                         2641
#define HFTUN1                        2642
#define HFTUN2                        2643
#define HFTUN3                        2644
#define HFTUN4                        2645
#define HFTUN5                        2646
#define OSCFRQ                        2647
#define HFFRQ                         2648
#define HFFRQ0                        2649
#define HFFRQ1                        2650
#define HFFRQ2                        2651
#define CLKRCON                       2652
#define CLKRDIV                       2653
#define CLKRDIV0                      2654
#define CLKRDIV1                      2655
#define CLKRDIV2                      2656
#define CLKRDC                        2657
#define CLKRDC0                       2658
#define CLKRDC1                       2659
#define CLKREN                        2660
#define CLKRCLK                       2661
#define CLKRCLK0                      2662
#define CLKRCLK1                      2663
#define CLKRCLK2                      2664
#define CLKRCLK3                      2665
#define MDCON0                        2666
#define MDBIT                         2667
#define MDOPOL                        2668
#define MDOUT                         2669
#define MDEN                          2670
#define MDCON1                        2671
#define MDCLSYNC                      2672
#define MDCLPOL                       2673
#define MDCHSYNC                      2674
#define MDCHPOL                       2675
#define MDSRC                         2676
#define MDMS0                         2677
#define MDMS                          2678
#define MDMS1                         2679
#define MDMS2                         2680
#define MDMS3                         2681
#define MDMS4                         2682
#define MDCARL                        2683
#define MDCL0                         2684
#define MDCL                          2685
#define MDCL1                         2686
#define MDCL2                         2687
#define MDCL3                         2688
#define MDCARH                        2689
#define MDCH                          2690
#define MDCH0                         2691
#define MDCH1                         2692
#define MDCH2                         2693
#define MDCH3                         2694
#define FVRCON                        2695
#define ADFVR0                        2696
#define ADFVR                         2697
#define ADFVR1                        2698
#define CDAFVR                        2699
#define CDAFVR0                       2700
#define CDAFVR1                       2701
#define TSRNG                         2702
#define TSEN                          2703
#define FVRRDY                        2704
#define FVREN                         2705
#define DAC1CON0                      2706
#define NSS                           2707
#define DAC1NSS                       2708
#define DAC1PSS0                      2709
#define PSS                           2710
#define PSS0                          2711
#define PSS1                          2712
#define DAC1PSS1                      2713
#define OE2                           2714
#define DAC1OE2                       2715
#define OE1                           2716
#define DAC1OE1                       2717
#define DAC1CON0_EN                   2718
#define DAC1EN                        2719
#define DAC1CON1                      2720
#define DAC1R                         2721
#define DAC1R0                        2722
#define DAC1R1                        2723
#define DAC1R2                        2724
#define DAC1R3                        2725
#define DAC1R4                        2726
#define ZCD1CON                       2727
#define ZCD1CON_INTN                  2728
#define ZCDINTN                       2729
#define ZCD1INTN                      2730
#define ZCD1INTP                      2731
#define ZCD1CON_INTP                  2732
#define ZCDINTP                       2733
#define ZCDPOL                        2734
#define ZCD1CON_POL                   2735
#define ZCD1POL                       2736
#define ZCDOUT                        2737
#define ZCD1OUT                       2738
#define ZCD1CON_OUT                   2739
#define ZCDEN                         2740
#define ZCD1EN                        2741
#define ZCD1CON_EN                    2742
#define CMOUT                         2743
#define CMOUT_C1OUT                   2744
#define MC1OUT                        2745
#define MC2OUT                        2746
#define CMOUT_C2OUT                   2747
#define CM1CON0                       2748
#define CM1CON0_SYNC                  2749
#define C1SYNC                        2750
#define CM1CON0_HYS                   2751
#define C1HYS                         2752
#define C1SP                          2753
#define CM1CON0_POL                   2754
#define C1POL                         2755
#define CM1CON0_OUT                   2756
#define CM1CON0_C1OUT                 2757
#define CM1CON0_ON                    2758
#define C1ON                          2759
#define CM1CON1                       2760
#define C1INTN                        2761
#define CM1CON1_INTN                  2762
#define CM1CON1_INTP                  2763
#define C1INTP                        2764
