tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf18875_tdd.h
#define CM1NSEL                       2765
#define CM1NSEL_NCH0                  2766
#define C1NCH0                        2767
#define CM1NSEL_NCH                   2768
#define C1NCH                         2769
#define CM1NSEL_NCH1                  2770
#define C1NCH1                        2771
#define CM1NSEL_NCH2                  2772
#define C1NCH2                        2773
#define CM1PSEL                       2774
#define CM1PSEL_PCH                   2775
#define C1PCH                         2776
#define C1PCH0                        2777
#define CM1PSEL_PCH0                  2778
#define C1PCH1                        2779
#define CM1PSEL_PCH1                  2780
#define C1PCH2                        2781
#define CM1PSEL_PCH2                  2782
#define CM2CON0                       2783
#define CM2CON0_SYNC                  2784
#define C2SYNC                        2785
#define C2HYS                         2786
#define CM2CON0_HYS                   2787
#define C2SP                          2788
#define C2POL                         2789
#define CM2CON0_POL                   2790
#define CM2CON0_C2OUT                 2791
#define CM2CON0_OUT                   2792
#define CM2CON0_ON                    2793
#define C2ON                          2794
#define CM2CON1                       2795
#define C2INTN                        2796
#define CM2CON1_INTN                  2797
#define CM2CON1_INTP                  2798
#define C2INTP                        2799
#define CM2NSEL                       2800
#define C2NCH0                        2801
#define CM2NSEL_NCH0                  2802
#define C2NCH                         2803
#define CM2NSEL_NCH                   2804
#define C2NCH1                        2805
#define CM2NSEL_NCH1                  2806
#define C2NCH2                        2807
#define CM2NSEL_NCH2                  2808
#define CM2PSEL                       2809
#define CM2PSEL_PCH                   2810
#define C2PCH                         2811
#define C2PCH0                        2812
#define CM2PSEL_PCH0                  2813
#define C2PCH1                        2814
#define CM2PSEL_PCH1                  2815
#define CM2PSEL_PCH2                  2816
#define C2PCH2                        2817
#define CLCDATA                       2818
#define MLC1OUT                       2819
#define MLC2OUT                       2820
#define MLC3OUT                       2821
#define MLC4OUT                       2822
#define CLC1CON                       2823
#define CLC1CON_MODE                  2824
#define LC1MODE0                      2825
#define LC1MODE                       2826
#define CLC1CON_MODE0                 2827
#define LC1MODE1                      2828
#define CLC1CON_MODE1                 2829
#define LC1MODE2                      2830
#define CLC1CON_MODE2                 2831
#define LC1INTN                       2832
#define CLC1CON_INTN                  2833
#define LC1INTP                       2834
#define CLC1CON_INTP                  2835
#define LC1OUT                        2836
#define CLC1CON_OUT                   2837
#define LC1EN                         2838
#define CLC1CON_EN                    2839
#define CLC1POL                       2840
#define LC1G1POL                      2841
#define CLC1POL_G1POL                 2842
#define CLC1POL_G2POL                 2843
#define LC1G2POL                      2844
#define LC1G3POL                      2845
#define CLC1POL_G3POL                 2846
#define LC1G4POL                      2847
#define CLC1POL_G4POL                 2848
#define CLC1POL_POL                   2849
#define LC1POL                        2850
#define CLC1SEL0                      2851
#define LC1D1S                        2852
#define CLC1SEL0_D1S0                 2853
#define LC1D1S0                       2854
#define CLC1SEL0_D1S                  2855
#define CLC1SEL0_D1S1                 2856
#define LC1D1S1                       2857
#define CLC1SEL0_D1S2                 2858
#define LC1D1S2                       2859
#define CLC1SEL0_D1S3                 2860
#define LC1D1S3                       2861
#define LC1D1S4                       2862
#define CLC1SEL0_D1S4                 2863
#define CLC1SEL0_D1S5                 2864
#define LC1D1S5                       2865
#define LC1D1S6                       2866
#define CLC1SEL0_D1S6                 2867
#define LC1D1S7                       2868
#define CLC1SEL0_D1S7                 2869
#define CLC1SEL1                      2870
#define CLC1SEL1_D2S                  2871
#define CLC1SEL1_D2S0                 2872
#define LC1D2S0                       2873
#define LC1D2S                        2874
#define CLC1SEL1_D2S1                 2875
#define LC1D2S1                       2876
#define CLC1SEL1_D2S2                 2877
#define LC1D2S2                       2878
#define CLC1SEL1_D2S3                 2879
#define LC1D2S3                       2880
#define LC1D2S4                       2881
#define CLC1SEL1_D2S4                 2882
#define D2S5                          2883
#define LC1D2S5                       2884
#define LC1D2S6                       2885
#define CLC1SEL1_D2S6                 2886
#define CLC1SEL1_D2S7                 2887
#define LC1D2S7                       2888
#define CLC1SEL2                      2889
#define CLC1SEL2_D3S                  2890
#define LC1D3S0                       2891
#define LC1D3S                        2892
#define CLC1SEL2_D3S0                 2893
#define LC1D3S1                       2894
#define CLC1SEL2_D3S1                 2895
#define LC1D3S2                       2896
#define CLC1SEL2_D3S2                 2897
#define LC1D3S3                       2898
#define CLC1SEL2_D3S3                 2899
#define LC1D3S4                       2900
#define CLC1SEL2_D3S4                 2901
#define LC1D3S5                       2902
#define CLC1SEL2_D3S5                 2903
#define LC1D3S6                       2904
#define CLC1SEL2_D3S6                 2905
#define LC1D3S7                       2906
#define CLC1SEL2_D3S7                 2907
#define CLC1SEL3                      2908
#define LC1D4S                        2909
#define CLC1SEL3_D4S                  2910
#define LC1D4S0                       2911
#define CLC1SEL3_D4S0                 2912
#define LC1D4S1                       2913
#define CLC1SEL3_D4S1                 2914
#define LC1D4S2                       2915
#define CLC1SEL3_D4S2                 2916
#define LC1D4S3                       2917
#define CLC1SEL3_D4S3                 2918
#define LC1D4S4                       2919
#define CLC1SEL3_D4S4                 2920
#define LC1D4S5                       2921
#define CLC1SEL3_D4S5                 2922
#define LC1D4S6                       2923
#define CLC1SEL3_D4S6                 2924
#define LC1D4S7                       2925
#define CLC1SEL3_D4S7                 2926
#define CLC1GLS0                      2927
#define CLC1GLS0_D1N                  2928
#define LC1G1D1N                      2929
#define CLC1GLS0_D1T                  2930
#define LC1G1D1T                      2931
#define LC1G1D2N                      2932
#define CLC1GLS0_D2N                  2933
#define LC1G1D2T                      2934
#define CLC1GLS0_D2T                  2935
#define CLC1GLS0_D3N                  2936
#define LC1G1D3N                      2937
#define CLC1GLS0_D3T                  2938
#define LC1G1D3T                      2939
#define CLC1GLS0_D4N                  2940
#define LC1G1D4N                      2941
#define CLC1GLS0_D4T                  2942
#define LC1G1D4T                      2943
#define CLC1GLS1                      2944
#define CLC1GLS1_D1N                  2945
#define LC1G2D1N                      2946
#define LC1G2D1T                      2947
#define CLC1GLS1_D1T                  2948
#define CLC1GLS1_D2N                  2949
#define LC1G2D2N                      2950
#define LC1G2D2T                      2951
#define CLC1GLS1_D2T                  2952
#define CLC1GLS1_D3N                  2953
#define LC1G2D3N                      2954
#define LC1G2D3T                      2955
#define CLC1GLS1_D3T                  2956
#define CLC1GLS1_D4N                  2957
#define LC1G2D4N                      2958
#define LC1G2D4T                      2959
#define CLC1GLS1_D4T                  2960
#define CLC1GLS2                      2961
#define CLC1GLS2_D1N                  2962
#define LC1G3D1N                      2963
#define LC1G3D1T                      2964
#define CLC1GLS2_D1T                  2965
#define LC1G3D2N                      2966
#define CLC1GLS2_D2N                  2967
#define LC1G3D2T                      2968
#define CLC1GLS2_D2T                  2969
#define CLC1GLS2_D3N                  2970
#define LC1G3D3N                      2971
#define LC1G3D3T                      2972
#define CLC1GLS2_D3T                  2973
#define LC1G3D4N                      2974
#define CLC1GLS2_D4N                  2975
#define LC1G3D4T                      2976
#define CLC1GLS2_D4T                  2977
#define CLC1GLS3                      2978
#define LC1G4D1N                      2979
#define CLC1GLS3_G4D1N                2980
#define LC1G4D1T                      2981
#define CLC1GLS3_G4D1T                2982
#define CLC1GLS3_G4D2N                2983
#define LC1G4D2N                      2984
#define CLC1GLS3_G4D2T                2985
#define LC1G4D2T                      2986
#define LC1G4D3N                      2987
#define CLC1GLS3_G4D3N                2988
#define LC1G4D3T                      2989
#define CLC1GLS3_G4D3T                2990
#define CLC1GLS3_G4D4N                2991
#define LC1G4D4N                      2992
#define CLC1GLS3_G4D4T                2993
#define LC1G4D4T                      2994
#define CLC2CON                       2995
#define LC2MODE0                      2996
#define CLC2CON_MODE                  2997
#define LC2MODE                       2998
#define CLC2CON_MODE0                 2999
#define LC2MODE1                      3000
#define CLC2CON_MODE1                 3001
#define LC2MODE2                      3002
#define CLC2CON_MODE2                 3003
#define LC2INTN                       3004
#define CLC2CON_INTN                  3005
#define LC2INTP                       3006
#define CLC2CON_INTP                  3007
#define CLC2CON_OUT                   3008
#define LC2OUT                        3009
#define CLC2CON_EN                    3010
#define LC2EN                         3011
#define CLC2POL                       3012
#define LC2G1POL                      3013
#define CLC2POL_G1POL                 3014
#define LC2G2POL                      3015
#define CLC2POL_G2POL                 3016
#define LC2G3POL                      3017
#define CLC2POL_G3POL                 3018
#define LC2G4POL                      3019
#define CLC2POL_G4POL                 3020
#define CLC2POL_POL                   3021
#define LC2POL                        3022
#define CLC2SEL0                      3023
#define CLC2SEL0_D1S                  3024
#define LC2D1S                        3025
#define LC2D1S0                       3026
#define CLC2SEL0_D1S0                 3027
#define LC2D1S1                       3028
#define CLC2SEL0_D1S1                 3029
#define LC2D1S2                       3030
#define CLC2SEL0_D1S2                 3031
#define LC2D1S3                       3032
#define CLC2SEL0_D1S3                 3033
#define LC2D1S4                       3034
#define CLC2SEL0_D1S4                 3035
#define LC2D1S5                       3036
#define CLC2SEL0_D1S5                 3037
#define LC2D1S6                       3038
#define CLC2SEL0_D1S6                 3039
#define LC2D1S7                       3040
#define CLC2SEL0_D1S7                 3041
#define CLC2SEL1                      3042
#define LC2D2S0                       3043
#define LC2D2S                        3044
#define CLC2SEL1_D2S                  3045
#define CLC2SEL1_D2S0                 3046
#define LC2D2S1                       3047
#define CLC2SEL1_D2S1                 3048
#define LC2D2S2                       3049
#define CLC2SEL1_D2S2                 3050
#define LC2D2S3                       3051
#define CLC2SEL1_D2S3                 3052
#define LC2D2S4                       3053
#define CLC2SEL1_D2S4                 3054
#define LC2D2S5                       3055
#define CLC2SEL1_D2S5                 3056
#define LC2D2S6                       3057
#define CLC2SEL1_D2S6                 3058
#define LC2D2S7                       3059
#define CLC2SEL1_D2S7                 3060
#define CLC2SEL2                      3061
#define CLC2SEL2_D3S0                 3062
#define LC2D3S                        3063
#define CLC2SEL2_D3S                  3064
#define LC2D3S0                       3065
#define CLC2SEL2_D3S1                 3066
#define LC2D3S1                       3067
#define CLC2SEL2_D3S2                 3068
#define LC2D3S2                       3069
#define CLC2SEL2_D3S3                 3070
#define LC2D3S3                       3071
#define CLC2SEL2_D3S4                 3072
#define LC2D3S4                       3073
#define CLC2SEL2_D3S5                 3074
#define LC2D3S5                       3075
#define CLC2SEL2_D3S6                 3076
#define LC2D3S6                       3077
#define CLC2SEL2_D3S7                 3078
#define LC2D3S7                       3079
#define CLC2SEL3                      3080
#define LC2D4S                        3081
#define CLC2SEL3_D4S0                 3082
#define LC2D4S0                       3083
#define CLC2SEL3_D4S                  3084
#define CLC2SEL3_D4S1                 3085
#define LC2D4S1                       3086
#define CLC2SEL3_D4S2                 3087
#define LC2D4S2                       3088
#define CLC2SEL3_D4S3                 3089
#define LC2D4S3                       3090
#define CLC2SEL3_D4S4                 3091
#define LC2D4S4                       3092
#define CLC2SEL3_D4S5                 3093
#define LC2D4S5                       3094
#define CLC2SEL3_D4S6                 3095
#define LC2D4S6                       3096
#define CLC2SEL3_D4S7                 3097
#define LC2D4S7                       3098
#define CLC2GLS0                      3099
#define LC2G1D1N                      3100
#define CLC2GLS0_D1N                  3101
#define CLC2GLS0_D1T                  3102
#define LC2G1D1T                      3103
#define LC2G1D2N                      3104
#define CLC2GLS0_D2N                  3105
#define CLC2GLS0_D2T                  3106
#define LC2G1D2T                      3107
#define LC2G1D3N                      3108
#define CLC2GLS0_D3N                  3109
#define CLC2GLS0_D3T                  3110
#define LC2G1D3T                      3111
#define LC2G1D4N                      3112
#define CLC2GLS0_D4N                  3113
#define CLC2GLS0_D4T                  3114
#define LC2G1D4T                      3115
#define CLC2GLS1                      3116
#define CLC2GLS1_D1N                  3117
#define LC2G2D1N                      3118
#define CLC2GLS1_D1T                  3119
#define LC2G2D1T                      3120
#define CLC2GLS1_D2N                  3121
#define LC2G2D2N                      3122
#define CLC2GLS1_D2T                  3123
#define LC2G2D2T                      3124
#define LC2G2D3N                      3125
#define CLC2GLS1_D3N                  3126
#define LC2G2D3T                      3127
#define CLC2GLS1_D3T                  3128
#define LC2G2D4N                      3129
#define CLC2GLS1_D4N                  3130
#define LC2G2D4T                      3131
#define CLC2GLS1_D4T                  3132
#define CLC2GLS2                      3133
#define LC2G3D1N                      3134
#define CLC2GLS2_D1N                  3135
#define CLC2GLS2_D1T                  3136
#define LC2G3D1T                      3137
#define CLC2GLS2_D2N                  3138
#define LC2G3D2N                      3139
#define LC2G3D2T                      3140
#define CLC2GLS2_D2T                  3141
#define CLC2GLS2_D3N                  3142
#define LC2G3D3N                      3143
#define CLC2GLS2_D3T                  3144
#define LC2G3D3T                      3145
#define CLC2GLS2_D4N                  3146
#define LC2G3D4N                      3147
#define LC2G3D4T                      3148
#define CLC2GLS2_D4T                  3149
#define CLC2GLS3                      3150
#define LC2G4D1N                      3151
#define CLC2GLS3_G4D1N                3152
#define CLC2GLS3_G4D1T                3153
#define LC2G4D1T                      3154
#define CLC2GLS3_G4D2N                3155
#define LC2G4D2N                      3156
#define LC2G4D2T                      3157
#define CLC2GLS3_G4D2T                3158
#define CLC2GLS3_G4D3N                3159
#define LC2G4D3N                      3160
#define CLC2GLS3_G4D3T                3161
#define LC2G4D3T                      3162
#define LC2G4D4N                      3163
#define CLC2GLS3_G4D4N                3164
#define CLC2GLS3_G4D4T                3165
#define LC2G4D4T                      3166
#define CLC3CON                       3167
#define LC3MODE                       3168
#define CLC3CON_MODE0                 3169
#define LC3MODE0                      3170
#define CLC3CON_MODE                  3171
#define CLC3CON_MODE1                 3172
#define LC3MODE1                      3173
#define CLC3CON_MODE2                 3174
#define LC3MODE2                      3175
#define LC3INTN                       3176
#define CLC3CON_INTN                  3177
#define LC3INTP                       3178
#define CLC3CON_INTP                  3179
#define LC3OUT                        3180
#define CLC3CON_OUT                   3181
#define LC3EN                         3182
#define CLC3CON_EN                    3183
#define CLC3POL                       3184
#define LC3G1POL                      3185
#define CLC3POL_G1POL                 3186
#define LC3G2POL                      3187
#define CLC3POL_G2POL                 3188
#define CLC3POL_G3POL                 3189
#define LC3G3POL                      3190
#define LC3G4POL                      3191
#define CLC3POL_G4POL                 3192
#define LC3POL                        3193
#define CLC3POL_POL                   3194
#define CLC3SEL0                      3195
#define LC3D1S                        3196
#define CLC3SEL0_D1S                  3197
#define LC3D1S0                       3198
#define CLC3SEL0_D1S0                 3199
#define LC3D1S1                       3200
#define CLC3SEL0_D1S1                 3201
#define LC3D1S2                       3202
#define CLC3SEL0_D1S2                 3203
#define LC3D1S3                       3204
#define CLC3SEL0_D1S3                 3205
#define LC3D1S4                       3206
#define CLC3SEL0_D1S4                 3207
#define LC3D1S5                       3208
#define CLC3SEL0_D1S5                 3209
#define LC3D1S6                       3210
#define CLC3SEL0_D1S6                 3211
#define LC3D1S7                       3212
#define CLC3SEL0_D1S7                 3213
#define CLC3SEL1                      3214
#define LC3D2S0                       3215
#define LC3D2S                        3216
#define CLC3SEL1_D2S0                 3217
#define CLC3SEL1_D2S                  3218
#define LC3D2S1                       3219
#define CLC3SEL1_D2S1                 3220
#define LC3D2S2                       3221
#define CLC3SEL1_D2S2                 3222
#define LC3D2S3                       3223
#define CLC3SEL1_D2S3                 3224
#define LC3D2S4                       3225
#define CLC3SEL1_D2S4                 3226
#define LC3D2S5                       3227
#define CLC3SEL1_D2S5                 3228
#define LC3D2S6                       3229
#define CLC3SEL1_D2S6                 3230
#define LC3D2S7                       3231
#define CLC3SEL1_D2S7                 3232
#define CLC3SEL2                      3233
#define LC3D3S                        3234
#define CLC3SEL2_D3S                  3235
#define LC3D3S0                       3236
#define CLC3SEL2_D3S0                 3237
#define LC3D3S1                       3238
#define CLC3SEL2_D3S1                 3239
#define LC3D3S2                       3240
#define CLC3SEL2_D3S2                 3241
#define LC3D3S3                       3242
#define CLC3SEL2_D3S3                 3243
#define LC3D3S4                       3244
#define CLC3SEL2_D3S4                 3245
#define LC3D3S5                       3246
#define CLC3SEL2_D3S5                 3247
#define LC3D3S6                       3248
#define CLC3SEL2_D3S6                 3249
#define LC3D3S7                       3250
#define CLC3SEL2_D3S7                 3251
#define CLC3SEL3                      3252
#define CLC3SEL3_D4S                  3253
#define LC3D4S0                       3254
#define LC3D4S                        3255
#define CLC3SEL3_D4S0                 3256
#define LC3D4S1                       3257
#define CLC3SEL3_D4S1                 3258
#define LC3D4S2                       3259
#define CLC3SEL3_D4S2                 3260
#define LC3D4S3                       3261
#define CLC3SEL3_D4S3                 3262
#define LC3D4S4                       3263
#define CLC3SEL3_D4S4                 3264
#define LC3D4S5                       3265
#define CLC3SEL3_D4S5                 3266
#define LC3D4S6                       3267
#define CLC3SEL3_D4S6                 3268
#define LC3D4S7                       3269
#define CLC3SEL3_D4S7                 3270
#define CLC3GLS0                      3271
#define CLC3GLS0_D1N                  3272
#define LC3G1D1N                      3273
#define LC3G1D1T                      3274
#define CLC3GLS0_D1T                  3275
#define LC3G1D2N                      3276
#define CLC3GLS0_D2N                  3277
#define CLC3GLS0_D2T                  3278
#define LC3G1D2T                      3279
#define CLC3GLS0_D3N                  3280
#define LC3G1D3N                      3281
#define LC3G1D3T                      3282
#define CLC3GLS0_D3T                  3283
#define CLC3GLS0_D4N                  3284
#define LC3G1D4N                      3285
#define CLC3GLS0_D4T                  3286
#define LC3G1D4T                      3287
#define CLC3GLS1                      3288
#define LC3G2D1N                      3289
#define CLC3GLS1_D1N                  3290
#define CLC3GLS1_D1T                  3291
#define LC3G2D1T                      3292
#define LC3G2D2N                      3293
#define CLC3GLS1_D2N                  3294
#define LC3G2D2T                      3295
#define CLC3GLS1_D2T                  3296
#define LC3G2D3N                      3297
#define CLC3GLS1_D3N                  3298
#define CLC3GLS1_D3T                  3299
#define LC3G2D3T                      3300
#define LC3G2D4N                      3301
#define CLC3GLS1_D4N                  3302
#define LC3G2D4T                      3303
#define CLC3GLS1_D4T                  3304
#define CLC3GLS2                      3305
#define LC3G3D1N                      3306
#define CLC3GLS2_D1N                  3307
#define LC3G3D1T                      3308
#define CLC3GLS2_D1T                  3309
#define CLC3GLS2_D2N                  3310
#define LC3G3D2N                      3311
#define CLC3GLS2_D2T                  3312
#define LC3G3D2T                      3313
#define CLC3GLS2_D3N                  3314
#define LC3G3D3N                      3315
#define LC3G3D3T                      3316
#define CLC3GLS2_D3T                  3317
#define CLC3GLS2_D4N                  3318
#define LC3G3D4N                      3319
#define CLC3GLS2_D4T                  3320
#define LC3G3D4T                      3321
#define CLC3GLS3                      3322
