tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf18875_tdd.h
#define LC3G4D1N                      3323
#define CLC3GLS3_G4D1N                3324
#define LC3G4D1T                      3325
#define CLC3GLS3_G4D1T                3326
#define LC3G4D2N                      3327
#define CLC3GLS3_G4D2N                3328
#define CLC3GLS3_G4D2T                3329
#define LC3G4D2T                      3330
#define LC3G4D3N                      3331
#define CLC3GLS3_G4D3N                3332
#define CLC3GLS3_G4D3T                3333
#define LC3G4D3T                      3334
#define LC3G4D4N                      3335
#define CLC3GLS3_G4D4N                3336
#define LC3G4D4T                      3337
#define CLC3GLS3_G4D4T                3338
#define CLC4CON                       3339
#define LC4MODE                       3340
#define CLC4CON_MODE                  3341
#define LC4MODE0                      3342
#define CLC4CON_MODE0                 3343
#define LC4MODE1                      3344
#define CLC4CON_MODE1                 3345
#define LC4MODE2                      3346
#define CLC4CON_MODE2                 3347
#define LC4INTN                       3348
#define CLC4CON_INTN                  3349
#define CLC4CON_INTP                  3350
#define LC4INTP                       3351
#define CLC4CON_OUT                   3352
#define LC4OUT                        3353
#define CLC4CON_EN                    3354
#define LC4EN                         3355
#define CLC4POL                       3356
#define CLC4POL_G1POL                 3357
#define LC4G1POL                      3358
#define CLC4POL_G2POL                 3359
#define LC4G2POL                      3360
#define CLC4POL_G3POL                 3361
#define LC4G3POL                      3362
#define LC4G4POL                      3363
#define CLC4POL_G4POL                 3364
#define LC4POL                        3365
#define CLC4POL_POL                   3366
#define CLC4SEL0                      3367
#define LC4D1S0                       3368
#define CLC4SEL0_D1S                  3369
#define CLC4SEL0_D1S0                 3370
#define LC4D1S                        3371
#define LC4D1S1                       3372
#define CLC4SEL0_D1S1                 3373
#define LC4D1S2                       3374
#define CLC4SEL0_D1S2                 3375
#define LC4D1S3                       3376
#define CLC4SEL0_D1S3                 3377
#define LC4D1S4                       3378
#define CLC4SEL0_D1S4                 3379
#define LC4D1S5                       3380
#define CLC4SEL0_D1S5                 3381
#define LC4D1S6                       3382
#define CLC4SEL0_D1S6                 3383
#define LC4D1S7                       3384
#define CLC4SEL0_D1S7                 3385
#define CLC4SEL1                      3386
#define CLC4SEL1_D2S                  3387
#define CLC4SEL1_D2S0                 3388
#define LC4D2S                        3389
#define LC4D2S0                       3390
#define CLC4SEL1_D2S1                 3391
#define LC4D2S1                       3392
#define CLC4SEL1_D2S2                 3393
#define LC4D2S2                       3394
#define CLC4SEL1_D2S3                 3395
#define LC4D2S3                       3396
#define CLC4SEL1_D2S4                 3397
#define LC4D2S4                       3398
#define CLC4SEL1_D2S5                 3399
#define LC4D2S5                       3400
#define CLC4SEL1_D2S6                 3401
#define LC4D2S6                       3402
#define CLC4SEL1_D2S7                 3403
#define LC4D2S7                       3404
#define CLC4SEL2                      3405
#define CLC4SEL2_D3S                  3406
#define LC4D3S0                       3407
#define LC4D3S                        3408
#define CLC4SEL2_D3S0                 3409
#define LC4D3S1                       3410
#define CLC4SEL2_D3S1                 3411
#define LC4D3S2                       3412
#define CLC4SEL2_D3S2                 3413
#define LC4D3S3                       3414
#define CLC4SEL2_D3S3                 3415
#define LC4D3S4                       3416
#define CLC4SEL2_D3S4                 3417
#define LC4D3S5                       3418
#define CLC4SEL2_D3S5                 3419
#define LC4D3S6                       3420
#define CLC4SEL2_D3S6                 3421
#define LC4D3S7                       3422
#define CLC4SEL2_D3S7                 3423
#define CLC4SEL3                      3424
#define CLC4SEL3_D4S                  3425
#define LC4D4S0                       3426
#define CLC4SEL3_D4S0                 3427
#define LC4D4S                        3428
#define LC4D4S1                       3429
#define CLC4SEL3_D4S1                 3430
#define LC4D4S2                       3431
#define CLC4SEL3_D4S2                 3432
#define LC4D4S3                       3433
#define CLC4SEL3_D4S3                 3434
#define LC4D4S4                       3435
#define CLC4SEL3_D4S4                 3436
#define LC4D4S5                       3437
#define CLC4SEL3_D4S5                 3438
#define LC4D4S6                       3439
#define CLC4SEL3_D4S6                 3440
#define LC4D4S7                       3441
#define CLC4SEL3_D4S7                 3442
#define CLC4GLS0                      3443
#define CLC4GLS0_D1N                  3444
#define LC4G1D1N                      3445
#define CLC4GLS0_D1T                  3446
#define LC4G1D1T                      3447
#define CLC4GLS0_D2N                  3448
#define LC4G1D2N                      3449
#define CLC4GLS0_D2T                  3450
#define LC4G1D2T                      3451
#define CLC4GLS0_D3N                  3452
#define LC4G1D3N                      3453
#define CLC4GLS0_D3T                  3454
#define LC4G1D3T                      3455
#define CLC4GLS0_D4N                  3456
#define LC4G1D4N                      3457
#define CLC4GLS0_D4T                  3458
#define LC4G1D4T                      3459
#define CLC4GLS1                      3460
#define CLC4GLS1_D1N                  3461
#define LC4G2D1N                      3462
#define CLC4GLS1_D1T                  3463
#define LC4G2D1T                      3464
#define LC4G2D2N                      3465
#define CLC4GLS1_D2N                  3466
#define LC4G2D2T                      3467
#define CLC4GLS1_D2T                  3468
#define CLC4GLS1_D3N                  3469
#define LC4G2D3N                      3470
#define LC4G2D3T                      3471
#define CLC4GLS1_D3T                  3472
#define CLC4GLS1_D4N                  3473
#define LC4G2D4N                      3474
#define CLC4GLS1_D4T                  3475
#define LC4G2D4T                      3476
#define CLC4GLS2                      3477
#define CLC4GLS2_D1N                  3478
#define LC4G3D1N                      3479
#define CLC4GLS2_D1T                  3480
#define LC4G3D1T                      3481
#define LC4G3D2N                      3482
#define CLC4GLS2_D2N                  3483
#define LC4G3D2T                      3484
#define CLC4GLS2_D2T                  3485
#define CLC4GLS2_D3N                  3486
#define LC4G3D3N                      3487
#define CLC4GLS2_D3T                  3488
#define LC4G3D3T                      3489
#define LC4G3D4N                      3490
#define CLC4GLS2_D4N                  3491
#define LC4G3D4T                      3492
#define CLC4GLS2_D4T                  3493
#define CLC4GLS3                      3494
#define CLC4GLS3_G4D1N                3495
#define LC4G4D1N                      3496
#define LC4G4D1T                      3497
#define CLC4GLS3_G4D1T                3498
#define LC4G4D2N                      3499
#define CLC4GLS3_G4D2N                3500
#define LC4G4D2T                      3501
#define CLC4GLS3_G4D2T                3502
#define CLC4GLS3_G4D3N                3503
#define LC4G4D3N                      3504
#define CLC4GLS3_G4D3T                3505
#define LC4G4D3T                      3506
#define LC4G4D4N                      3507
#define CLC4GLS3_G4D4N                3508
#define LC4G4D4T                      3509
#define CLC4GLS3_G4D4T                3510
#define PPSLOCK                       3511
#define PPSLOCKED                     3512
#define INTPPS0                       3513
#define INTPPS                        3514
#define INTPPS1                       3515
#define INTPPS2                       3516
#define INTPPS3                       3517
#define T0CKIPPS                      3518
#define T0CKIPPS0                     3519
#define T0CKIPPS1                     3520
#define T0CKIPPS2                     3521
#define T0CKIPPS3                     3522
#define T1CKIPPS0                     3523
#define T1CKIPPS                      3524
#define T1CKIPPS1                     3525
#define T1CKIPPS2                     3526
#define T1CKIPPS3                     3527
#define T1CKIPPS4                     3528
#define T1GPPS0                       3529
#define T1GPPS                        3530
#define T1GPPS1                       3531
#define T1GPPS2                       3532
#define T1GPPS3                       3533
#define T1GPPS4                       3534
#define T3CKIPPS0                     3535
#define T3CKIPPS                      3536
#define T3CKIPPS1                     3537
#define T3CKIPPS2                     3538
#define T3CKIPPS3                     3539
#define T3CKIPPS4                     3540
#define T3GPPS0                       3541
#define T3GPPS                        3542
#define T3GPPS1                       3543
#define T3GPPS2                       3544
#define T3GPPS3                       3545
#define T3GPPS4                       3546
#define T5CKIPPS0                     3547
#define T5CKIPPS                      3548
#define T5CKIPPS1                     3549
#define T5CKIPPS2                     3550
#define T5CKIPPS3                     3551
#define T5CKIPPS4                     3552
#define T5GPPS                        3553
#define T5GPPS0                       3554
#define T5GPPS1                       3555
#define T5GPPS2                       3556
#define T5GPPS3                       3557
#define T5GPPS4                       3558
#define T2AINPPS                      3559
#define T2AINPPS0                     3560
#define T2AINPPS1                     3561
#define T2AINPPS2                     3562
#define T2AINPPS3                     3563
#define T2AINPPS4                     3564
#define T4AINPPS                      3565
#define T4AINPPS0                     3566
#define T4AINPPS1                     3567
#define T4AINPPS2                     3568
#define T4AINPPS3                     3569
#define T4AINPPS4                     3570
#define T6AINPPS0                     3571
#define T6AINPPS                      3572
#define T6AINPPS1                     3573
#define T6AINPPS2                     3574
#define T6AINPPS3                     3575
#define T6AINPPS4                     3576
#define CCP1PPS0                      3577
#define CCP1PPS                       3578
#define CCP1PPS1                      3579
#define CCP1PPS2                      3580
#define CCP1PPS3                      3581
#define CCP1PPS4                      3582
#define CCP2PPS0                      3583
#define CCP2PPS                       3584
#define CCP2PPS1                      3585
#define CCP2PPS2                      3586
#define CCP2PPS3                      3587
#define CCP2PPS4                      3588
#define CCP3PPS0                      3589
#define CCP3PPS                       3590
#define CCP3PPS1                      3591
#define CCP3PPS2                      3592
#define CCP3PPS3                      3593
#define CCP3PPS4                      3594
#define CCP4PPS0                      3595
#define CCP4PPS                       3596
#define CCP4PPS1                      3597
#define CCP4PPS2                      3598
#define CCP4PPS3                      3599
#define CCP4PPS4                      3600
#define CCP5PPS                       3601
#define CCP5PPS0                      3602
#define CCP5PPS1                      3603
#define CCP5PPS2                      3604
#define CCP5PPS3                      3605
#define CCP5PPS4                      3606
#define CCP6PPS                       3607
#define SMT1WINPPS                    3608
#define SMU1WINPPS0                   3609
#define SMU1WINPPS1                   3610
#define SMU1WINPPS2                   3611
#define SMU1WINPPS3                   3612
#define SMU1WINPPS4                   3613
#define SMT1SIGPPS                    3614
#define SMU1SIGPPS0                   3615
#define SMU1SIGPPS1                   3616
#define SMU1SIGPPS2                   3617
#define SMU1SIGPPS3                   3618
#define SMU1SIGPPS4                   3619
#define SMT2WINPPS                    3620
#define SMU2WINPPS0                   3621
#define SMU2WINPPS1                   3622
#define SMU2WINPPS2                   3623
#define SMU2WINPPS3                   3624
#define SMU2WINPPS4                   3625
#define SMT2SIGPPS                    3626
#define SMU2SIGPPS0                   3627
#define SMU2SIGPPS1                   3628
#define SMU2SIGPPS2                   3629
#define SMU2SIGPPS3                   3630
#define SMU2SIGPPS4                   3631
#define CWG1PPS0                      3632
#define CWG1PPS                       3633
#define CWG1PPS1                      3634
#define CWG1PPS2                      3635
#define CWG1PPS3                      3636
#define CWG1PPS4                      3637
#define CWG2PPS0                      3638
#define CWG2PPS                       3639
#define CWG2PPS1                      3640
#define CWG2PPS2                      3641
#define CWG2PPS3                      3642
#define CWG2PPS4                      3643
#define CWG3PPS0                      3644
#define CWG3PPS                       3645
#define CWG3PPS1                      3646
#define CWG3PPS2                      3647
#define CWG3PPS3                      3648
#define CWG3PPS4                      3649
#define MDCARLPPS                     3650
#define MDCARLPPS0                    3651
#define MDCARLPPS1                    3652
#define MDCARLPPS2                    3653
#define MDCARLPPS3                    3654
#define MDCARLPPS4                    3655
#define MDCARHPPS0                    3656
#define MDCARHPPS                     3657
#define MDCARHPPS1                    3658
#define MDCARHPPS2                    3659
#define MDCARHPPS3                    3660
#define MDCARHPPS4                    3661
#define MDSRCPPS0                     3662
#define MDSRCPPS                      3663
#define MDSRCPPS1                     3664
#define MDSRCPPS2                     3665
#define MDSRCPPS3                     3666
#define MDSRCPPS4                     3667
#define CLCIN0PPS                     3668
#define CLCIN0PPS0                    3669
#define CLCIN0PPS1                    3670
#define CLCIN0PPS2                    3671
#define CLCIN0PPS3                    3672
#define CLCIN0PPS4                    3673
#define CLCIN1PPS                     3674
#define CLCIN1PPS0                    3675
#define CLCIN1PPS1                    3676
#define CLCIN1PPS2                    3677
#define CLCIN1PPS3                    3678
#define CLCIN1PPS4                    3679
#define CLCIN2PPS                     3680
#define CLCIN2PPS0                    3681
#define CLCIN2PPS1                    3682
#define CLCIN2PPS2                    3683
#define CLCIN2PPS3                    3684
#define CLCIN2PPS4                    3685
#define CLCIN3PPS                     3686
#define CLCIN3PPS0                    3687
#define CLCIN3PPS1                    3688
#define CLCIN3PPS2                    3689
#define CLCIN3PPS3                    3690
#define CLCIN3PPS4                    3691
#define ADCACTPPS                     3692
#define ADCACTPPS0                    3693
#define ADCACTPPS1                    3694
#define ADCACTPPS2                    3695
#define ADCACTPPS3                    3696
#define ADCACTPPS4                    3697
#define SSP1CLKPPS                    3698
#define SSP1CLKPPS0                   3699
#define SSP1CLKPPS1                   3700
#define SSP1CLKPPS2                   3701
#define SSP1CLKPPS3                   3702
#define SSP1CLKPPS4                   3703
#define SSP1DATPPS                    3704
#define SSP1DATPPS0                   3705
#define SSP1DATPPS1                   3706
#define SSP1DATPPS2                   3707
#define SSP1DATPPS3                   3708
#define SSP1DATPPS4                   3709
#define SSP1SSPPS                     3710
#define SSP1SSPPS0                    3711
#define SSP1SSPPS1                    3712
#define SSP1SSPPS2                    3713
#define SSP1SSPPS3                    3714
#define SSP1SSPPS4                    3715
#define SSP2CLKPPS                    3716
#define SSP2CLKPPS0                   3717
#define SSP2CLKPPS1                   3718
#define SSP2CLKPPS2                   3719
#define SSP2CLKPPS3                   3720
#define SSP2CLKPPS4                   3721
#define SSP2DATPPS                    3722
#define SSP2DATPPS0                   3723
#define SSP2DATPPS1                   3724
#define SSP2DATPPS2                   3725
#define SSP2DATPPS3                   3726
#define SSP2DATPPS4                   3727
#define SSP2SSPPS                     3728
#define SSP2SSPPS0                    3729
#define SSP2SSPPS1                    3730
#define SSP2SSPPS2                    3731
#define SSP2SSPPS3                    3732
#define SSP2SSPPS4                    3733
#define RXPPS                         3734
#define RXPPS0                        3735
#define RXPPS1                        3736
#define RXPPS2                        3737
#define RXPPS3                        3738
#define RXPPS4                        3739
#define TXPPS                         3740
#define TXPPS0                        3741
#define TXPPS1                        3742
#define TXPPS2                        3743
#define TXPPS3                        3744
#define TXPPS4                        3745
#define RA0PPS                        3746
#define RA0PPS0                       3747
#define RA0PPS1                       3748
#define RA0PPS2                       3749
#define RA0PPS3                       3750
#define RA0PPS4                       3751
#define RA0PPS5                       3752
#define RA1PPS                        3753
#define RA1PPS0                       3754
#define RA1PPS1                       3755
#define RA1PPS2                       3756
#define RA1PPS3                       3757
#define RA1PPS4                       3758
#define RA1PPS5                       3759
#define RA2PPS                        3760
#define RA2PPS0                       3761
#define RA2PPS1                       3762
#define RA2PPS2                       3763
#define RA2PPS3                       3764
#define RA2PPS4                       3765
#define RA2PPS5                       3766
#define RA3PPS                        3767
#define RA3PPS0                       3768
#define RA3PPS1                       3769
#define RA3PPS2                       3770
#define RA3PPS3                       3771
#define RA3PPS4                       3772
#define RA3PPS5                       3773
#define RA4PPS                        3774
#define RA4PPS0                       3775
#define RA4PPS1                       3776
#define RA4PPS2                       3777
#define RA4PPS3                       3778
#define RA4PPS4                       3779
#define RA4PPS5                       3780
#define RA5PPS                        3781
#define RA5PPS0                       3782
#define RA5PPS1                       3783
#define RA5PPS2                       3784
#define RA5PPS3                       3785
#define RA5PPS4                       3786
#define RA5PPS5                       3787
#define RA6PPS                        3788
#define RA6PPS0                       3789
#define RA6PPS1                       3790
#define RA6PPS2                       3791
#define RA6PPS3                       3792
#define RA6PPS4                       3793
#define RA6PPS5                       3794
#define RA7PPS                        3795
#define RA7PPS0                       3796
#define RA7PPS1                       3797
#define RA7PPS2                       3798
#define RA7PPS3                       3799
#define RA7PPS4                       3800
#define RA7PPS5                       3801
#define RB0PPS                        3802
#define RB0PPS0                       3803
#define RB0PPS1                       3804
#define RB0PPS2                       3805
#define RB0PPS3                       3806
#define RB0PPS4                       3807
#define RB0PPS5                       3808
#define RB1PPS                        3809
#define RB1PPS0                       3810
#define RB1PPS1                       3811
#define RB1PPS2                       3812
#define RB1PPS3                       3813
#define RB1PPS4                       3814
#define RB1PPS5                       3815
#define RB2PPS                        3816
#define RB2PPS0                       3817
#define RB2PPS1                       3818
#define RB2PPS2                       3819
#define RB2PPS3                       3820
#define RB2PPS4                       3821
#define RB2PPS5                       3822
#define RB3PPS                        3823
#define RB3PPS0                       3824
#define RB3PPS1                       3825
#define RB3PPS2                       3826
#define RB3PPS3                       3827
#define RB3PPS4                       3828
#define RB3PPS5                       3829
#define RB4PPS                        3830
#define RB4PPS0                       3831
#define RB4PPS1                       3832
#define RB4PPS2                       3833
#define RB4PPS3                       3834
#define RB4PPS4                       3835
#define RB4PPS5                       3836
#define RB5PPS                        3837
#define RB5PPS0                       3838
#define RB5PPS1                       3839
#define RB5PPS2                       3840
#define RB5PPS3                       3841
#define RB5PPS4                       3842
#define RB5PPS5                       3843
#define RB6PPS                        3844
#define RB6PPS0                       3845
#define RB6PPS1                       3846
#define RB6PPS2                       3847
#define RB6PPS3                       3848
#define RB6PPS4                       3849
#define RB6PPS5                       3850
#define RB7PPS                        3851
#define RB7PPS0                       3852
#define RB7PPS1                       3853
#define RB7PPS2                       3854
#define RB7PPS3                       3855
#define RB7PPS4                       3856
#define RB7PPS5                       3857
#define RC0PPS                        3858
#define RC0PPS0                       3859
#define RC0PPS1                       3860
#define RC0PPS2                       3861
#define RC0PPS3                       3862
#define RC0PPS4                       3863
#define RC0PPS5                       3864
#define RC1PPS                        3865
#define RC1PPS0                       3866
#define RC1PPS1                       3867
#define RC1PPS2                       3868
#define RC1PPS3                       3869
#define RC1PPS4                       3870
#define RC1PPS5                       3871
#define RC2PPS                        3872
#define RC2PPS0                       3873
#define RC2PPS1                       3874
#define RC2PPS2                       3875
#define RC2PPS3                       3876
#define RC2PPS4                       3877
#define RC2PPS5                       3878
#define RC3PPS                        3879
#define RC3PPS0                       3880
