tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf18875_tdd.h
#define RC3PPS1                       3881
#define RC3PPS2                       3882
#define RC3PPS3                       3883
#define RC3PPS4                       3884
#define RC3PPS5                       3885
#define RC4PPS                        3886
#define RC4PPS0                       3887
#define RC4PPS1                       3888
#define RC4PPS2                       3889
#define RC4PPS3                       3890
#define RC4PPS4                       3891
#define RC4PPS5                       3892
#define RC5PPS                        3893
#define RC5PPS0                       3894
#define RC5PPS1                       3895
#define RC5PPS2                       3896
#define RC5PPS3                       3897
#define RC5PPS4                       3898
#define RC5PPS5                       3899
#define RC6PPS                        3900
#define RC6PPS0                       3901
#define RC6PPS1                       3902
#define RC6PPS2                       3903
#define RC6PPS3                       3904
#define RC6PPS4                       3905
#define RC6PPS5                       3906
#define RC7PPS                        3907
#define RC7PPS0                       3908
#define RC7PPS1                       3909
#define RC7PPS2                       3910
#define RC7PPS3                       3911
#define RC7PPS4                       3912
#define RC7PPS5                       3913
#define RD0PPS                        3914
#define RD0PPS0                       3915
#define RD0PPS1                       3916
#define RD0PPS2                       3917
#define RD0PPS3                       3918
#define RD0PPS4                       3919
#define RD0PPS5                       3920
#define RD1PPS                        3921
#define RD1PPS0                       3922
#define RD1PPS1                       3923
#define RD1PPS2                       3924
#define RD1PPS3                       3925
#define RD1PPS4                       3926
#define RD1PPS5                       3927
#define RD2PPS                        3928
#define RD2PPS0                       3929
#define RD2PPS1                       3930
#define RD2PPS2                       3931
#define RD2PPS3                       3932
#define RD2PPS4                       3933
#define RD2PPS5                       3934
#define RD3PPS                        3935
#define RD3PPS0                       3936
#define RD3PPS1                       3937
#define RD3PPS2                       3938
#define RD3PPS3                       3939
#define RD3PPS4                       3940
#define RD3PPS5                       3941
#define RD4PPS                        3942
#define RD4PPS0                       3943
#define RD4PPS1                       3944
#define RD4PPS2                       3945
#define RD4PPS3                       3946
#define RD4PPS4                       3947
#define RD4PPS5                       3948
#define RD5PPS                        3949
#define RD5PPS0                       3950
#define RD5PPS1                       3951
#define RD5PPS2                       3952
#define RD5PPS3                       3953
#define RD5PPS4                       3954
#define RD5PPS5                       3955
#define RD6PPS                        3956
#define RD6PPS0                       3957
#define RD6PPS1                       3958
#define RD6PPS2                       3959
#define RD6PPS3                       3960
#define RD6PPS4                       3961
#define RD6PPS5                       3962
#define RD7PPS                        3963
#define RD7PPS0                       3964
#define RD7PPS1                       3965
#define RD7PPS2                       3966
#define RD7PPS3                       3967
#define RD7PPS4                       3968
#define RD7PPS5                       3969
#define RE0PPS                        3970
#define RE0PPS0                       3971
#define RE0PPS1                       3972
#define RE0PPS2                       3973
#define RE0PPS3                       3974
#define RE0PPS4                       3975
#define RE0PPS5                       3976
#define RE1PPS                        3977
#define RE1PPS0                       3978
#define RE1PPS1                       3979
#define RE1PPS2                       3980
#define RE1PPS3                       3981
#define RE1PPS4                       3982
#define RE1PPS5                       3983
#define RE2PPS                        3984
#define RE2PPS0                       3985
#define RE2PPS1                       3986
#define RE2PPS2                       3987
#define RE2PPS3                       3988
#define RE2PPS4                       3989
#define RE2PPS5                       3990
#define ANSELA                        3991
#define ANSA0                         3992
#define ANSA1                         3993
#define ANSA2                         3994
#define ANSA3                         3995
#define ANSA4                         3996
#define ANSA5                         3997
#define ANSA6                         3998
#define ANSA7                         3999
#define WPUA                          4000
#define WPUA0                         4001
#define WPUA1                         4002
#define WPUA2                         4003
#define WPUA3                         4004
#define WPUA4                         4005
#define WPUA5                         4006
#define WPUA6                         4007
#define WPUA7                         4008
#define ODCONA                        4009
#define ODCA0                         4010
#define ODCA1                         4011
#define ODCA2                         4012
#define ODCA3                         4013
#define ODCA4                         4014
#define ODCA5                         4015
#define ODCA6                         4016
#define ODCA7                         4017
#define SLRCONA                       4018
#define SLRA0                         4019
#define SLRA1                         4020
#define SLRA2                         4021
#define SLRA3                         4022
#define SLRA4                         4023
#define SLRA5                         4024
#define SLRA6                         4025
#define SLRA7                         4026
#define INLVLA                        4027
#define INLVLA0                       4028
#define INLVLA1                       4029
#define INLVLA2                       4030
#define INLVLA3                       4031
#define INLVLA4                       4032
#define INLVLA5                       4033
#define INLVLA6                       4034
#define INLVLA7                       4035
#define IOCAP                         4036
#define IOCAP0                        4037
#define IOCAP1                        4038
#define IOCAP2                        4039
#define IOCAP3                        4040
#define IOCAP4                        4041
#define IOCAP5                        4042
#define IOCAP6                        4043
#define IOCAP7                        4044
#define IOCAN                         4045
#define IOCAN0                        4046
#define IOCAN1                        4047
#define IOCAN2                        4048
#define IOCAN3                        4049
#define IOCAN4                        4050
#define IOCAN5                        4051
#define IOCAN6                        4052
#define IOCAN7                        4053
#define IOCAF                         4054
#define IOCAF0                        4055
#define IOCAF1                        4056
#define IOCAF2                        4057
#define IOCAF3                        4058
#define IOCAF4                        4059
#define IOCAF5                        4060
#define IOCAF6                        4061
#define IOCAF7                        4062
#define CCDNA                         4063
#define CCDNA0                        4064
#define CCDNA1                        4065
#define CCDNA2                        4066
#define CCDNA3                        4067
#define CCDNA4                        4068
#define CCDNA5                        4069
#define CCDNA6                        4070
#define CCDNA7                        4071
#define CCDPA                         4072
#define CCDPA0                        4073
#define CCDPA1                        4074
#define CCDPA2                        4075
#define CCDPA3                        4076
#define CCDPA4                        4077
#define CCDPA5                        4078
#define CCDPA6                        4079
#define CCDPA7                        4080
#define ANSELB                        4081
#define ANSB0                         4082
#define ANSB1                         4083
#define ANSB2                         4084
#define ANSB3                         4085
#define ANSB4                         4086
#define ANSB5                         4087
#define ANSB6                         4088
#define ANSB7                         4089
#define WPUB                          4090
#define WPUB0                         4091
#define WPUB1                         4092
#define WPUB2                         4093
#define WPUB3                         4094
#define WPUB4                         4095
#define WPUB5                         4096
#define WPUB6                         4097
#define WPUB7                         4098
#define ODCONB                        4099
#define ODCB0                         4100
#define ODCB1                         4101
#define ODCB2                         4102
#define ODCB3                         4103
#define ODCB4                         4104
#define ODCB5                         4105
#define ODCB6                         4106
#define ODCB7                         4107
#define SLRCONB                       4108
#define SLRB0                         4109
#define SLRB1                         4110
#define SLRB2                         4111
#define SLRB3                         4112
#define SLRB4                         4113
#define SLRB5                         4114
#define SLRB6                         4115
#define SLRB7                         4116
#define INLVLB                        4117
#define INLVLB0                       4118
#define INLVLB1                       4119
#define INLVLB2                       4120
#define INLVLB3                       4121
#define INLVLB4                       4122
#define INLVLB5                       4123
#define INLVLB6                       4124
#define INLVLB7                       4125
#define IOCBP                         4126
#define IOCBP0                        4127
#define IOCBP1                        4128
#define IOCBP2                        4129
#define IOCBP3                        4130
#define IOCBP4                        4131
#define IOCBP5                        4132
#define IOCBP6                        4133
#define IOCBP7                        4134
#define IOCBN                         4135
#define IOCBN0                        4136
#define IOCBN1                        4137
#define IOCBN2                        4138
#define IOCBN3                        4139
#define IOCBN4                        4140
#define IOCBN5                        4141
#define IOCBN6                        4142
#define IOCBN7                        4143
#define IOCBF                         4144
#define IOCBF0                        4145
#define IOCBF1                        4146
#define IOCBF2                        4147
#define IOCBF3                        4148
#define IOCBF4                        4149
#define IOCBF5                        4150
#define IOCBF6                        4151
#define IOCBF7                        4152
#define CCDNB                         4153
#define CCDNB0                        4154
#define CCDNB1                        4155
#define CCDNB2                        4156
#define CCDNB3                        4157
#define CCDNB4                        4158
#define CCDNB5                        4159
#define CCDNB6                        4160
#define CCDNB7                        4161
#define CCDPB                         4162
#define CCDPB0                        4163
#define CCDPB1                        4164
#define CCDPB2                        4165
#define CCDPB3                        4166
#define CCDPB4                        4167
#define CCDPB5                        4168
#define CCDPB6                        4169
#define CCDPB7                        4170
#define ANSELC                        4171
#define ANSC0                         4172
#define ANSC1                         4173
#define ANSC2                         4174
#define ANSC3                         4175
#define ANSC4                         4176
#define ANSC5                         4177
#define ANSC6                         4178
#define ANSC7                         4179
#define WPUC                          4180
#define WPUC0                         4181
#define WPUC1                         4182
#define WPUC2                         4183
#define WPUC3                         4184
#define WPUC4                         4185
#define WPUC5                         4186
#define WPUC6                         4187
#define WPUC7                         4188
#define ODCONC                        4189
#define ODCC0                         4190
#define ODCC1                         4191
#define ODCC2                         4192
#define ODCC3                         4193
#define ODCC4                         4194
#define ODCC5                         4195
#define ODCC6                         4196
#define ODCC7                         4197
#define SLRCONC                       4198
#define SLRC0                         4199
#define SLRC1                         4200
#define SLRC2                         4201
#define SLRC3                         4202
#define SLRC4                         4203
#define SLRC5                         4204
#define SLRC6                         4205
#define SLRC7                         4206
#define INLVLC                        4207
#define INLVLC0                       4208
#define INLVLC1                       4209
#define INLVLC2                       4210
#define INLVLC3                       4211
#define INLVLC4                       4212
#define INLVLC5                       4213
#define INLVLC6                       4214
#define INLVLC7                       4215
#define IOCCP                         4216
#define IOCCP0                        4217
#define IOCCP1                        4218
#define IOCCP2                        4219
#define IOCCP3                        4220
#define IOCCP4                        4221
#define IOCCP5                        4222
#define IOCCP6                        4223
#define IOCCP7                        4224
#define IOCCN                         4225
#define IOCCN0                        4226
#define IOCCN1                        4227
#define IOCCN2                        4228
#define IOCCN3                        4229
#define IOCCN4                        4230
#define IOCCN5                        4231
#define IOCCN6                        4232
#define IOCCN7                        4233
#define IOCCF                         4234
#define IOCCF0                        4235
#define IOCCF1                        4236
#define IOCCF2                        4237
#define IOCCF3                        4238
#define IOCCF4                        4239
#define IOCCF5                        4240
#define IOCCF6                        4241
#define IOCCF7                        4242
#define CCDNC                         4243
#define CCDNC0                        4244
#define CCDNC1                        4245
#define CCDNC2                        4246
#define CCDNC3                        4247
#define CCDNC4                        4248
#define CCDNC5                        4249
#define CCDNC6                        4250
#define CCDNC7                        4251
#define CCDPC                         4252
#define CCDPC0                        4253
#define CCDPC1                        4254
#define CCDPC2                        4255
#define CCDPC3                        4256
#define CCDPC4                        4257
#define CCDPC5                        4258
#define CCDPC6                        4259
#define CCDPC7                        4260
#define ANSELD                        4261
#define ANSD0                         4262
#define ANSD1                         4263
#define ANSD2                         4264
#define ANSD3                         4265
#define ANSD4                         4266
#define ANSD5                         4267
#define ANSD6                         4268
#define ANSD7                         4269
#define WPUD                          4270
#define WPUD0                         4271
#define WPUD1                         4272
#define WPUD2                         4273
#define WPUD3                         4274
#define WPUD4                         4275
#define WPUD5                         4276
#define WPUD6                         4277
#define WPUD7                         4278
#define ODCOND                        4279
#define ODCD0                         4280
#define ODCD1                         4281
#define ODCD2                         4282
#define ODCD3                         4283
#define ODCD4                         4284
#define ODCD5                         4285
#define ODCD6                         4286
#define ODCD7                         4287
#define SLRCOND                       4288
#define SLRD0                         4289
#define SLRD1                         4290
#define SLRD2                         4291
#define SLRD3                         4292
#define SLRD4                         4293
#define SLRD5                         4294
#define SLRD6                         4295
#define SLRD7                         4296
#define INLVLD                        4297
#define INLVLD0                       4298
#define INLVLD1                       4299
#define INLVLD2                       4300
#define INLVLD3                       4301
#define INLVLD4                       4302
#define INLVLD5                       4303
#define INLVLD6                       4304
#define INLVLD7                       4305
#define CCDND                         4306
#define CCDND0                        4307
#define CCDND1                        4308
#define CCDND2                        4309
#define CCDND3                        4310
#define CCDND4                        4311
#define CCDND5                        4312
#define CCDND6                        4313
#define CCDND7                        4314
#define CCDPD                         4315
#define CCDPD0                        4316
#define CCDPD1                        4317
#define CCDPD2                        4318
#define CCDPD3                        4319
#define CCDPD4                        4320
#define CCDPD5                        4321
#define CCDPD6                        4322
#define CCDPD7                        4323
#define ANSELE                        4324
#define ANSE0                         4325
#define ANSE1                         4326
#define ANSE2                         4327
#define WPUE                          4328
#define WPUE0                         4329
#define WPUE1                         4330
#define WPUE2                         4331
#define WPUE3                         4332
#define ODCONE                        4333
#define ODCE0                         4334
#define ODCE1                         4335
#define ODCE2                         4336
#define SLRCONE                       4337
#define SLRE0                         4338
#define SLRE1                         4339
#define SLRE2                         4340
#define INLVLE                        4341
#define INLVLE0                       4342
#define INLVLE1                       4343
#define INLVLE2                       4344
#define INLVLE3                       4345
#define IOCEP                         4346
#define IOCEP3                        4347
#define IOCEN                         4348
#define IOCEN3                        4349
#define IOCEF                         4350
#define IOCEF3                        4351
#define CCDNE                         4352
#define CCDNE0                        4353
#define CCDNE1                        4354
#define CCDNE2                        4355
#define CCDPE                         4356
#define CCDPE0                        4357
#define CCDPE1                        4358
#define CCDPE2                        4359
#define STATUS_SHAD                   4360
#define C_SHAD                        4361
#define DC_SHAD                       4362
#define Z_SHAD                        4363
#define WREG_SHAD                     4364
#define BSR_SHAD                      4365
#define PCLATH_SHAD                   4366
#define FSR0L_SHAD                    4367
#define FSR0H_SHAD                    4368
#define FSR1L_SHAD                    4369
#define FSR1H_SHAD                    4370
#define STKPTR                        4371
#define TOSL                          4372
#define TOSH                          4373

#endif // _PIC16LF18875_H_
